tests/Messages/PaymentIntents/Mock/AttachPaymentMethodSuccess.txt

HTTP/1.1 200 OK
Date: Fri, 19 Aug 2016 06:10:53 GMT
Content-Type: application/json
Content-Length: 150

{
    "data": {
        "id": "pi_u9zxu56zCZecBPLQRMd1Qmhd",
        "type": "payment_intent",
        "attributes": {
            "amount": 10000,
            "currency": "PHP",
            "description": "Order #3928",
            "statement_descriptor": "PAYMONGO",
            "status": "succeeded",
            "livemode": false,
            "client_key": "pi_u9zxu56zCZecBPLQRMd1Qmhd_client_pce1c6SdbcEYPF8Y2sCkpq8B",
            "created_at": 1633098287,
            "updated_at": 1633098510,
            "last_payment_error": null,
            "payment_method_allowed": [
                "card"
            ],
            "payments": [
                {
                    "id": "pay_eVMZ4LLX15WwAhF7XqRd5vc5",
                    "type": "payment",
                    "attributes": {
                        "access_url": null,
                        "amount": 10000,
                        "balance_transaction_id": "bal_txn_KY2F2EmkWg87u5whzv9hanPV",
                        "billing": {
                            "address": {
                                "city": "Melbourne",
                                "country": "AU",
                                "line1": "Level 21, 459 Collins st",
                                "line2": null,
                                "postal_code": "3000",
                                "state": "VIC"
                            },
                            "email": "johndoe@example.com",
                            "name": "John Doe",
                            "phone": "+61 7 7010 1111"
                        },
                        "currency": "PHP",
                        "description": null,
                        "disputed": false,
                        "external_reference_number": null,
                        "fee": 1850,
                        "foreign_fee": 100,
                        "livemode": false,
                        "net_amount": 8050,
                        "origin": "api",
                        "payment_intent_id": "pi_u9zxu56zCZecBPLQRMd1Qmhd",
                        "payout": null,
                        "source": {
                            "id": "card_Qb1oXA5BB1eFne4AUxBbfawW",
                            "type": "card",
                            "brand": "visa",
                            "country": "US",
                            "last4": "4345"
                        },
                        "statement_descriptor": "PAYMONGO",
                        "status": "paid",
                        "tax_amount": null,
                        "refunds": [],
                        "taxes": [],
                        "available_at": 1633597200,
                        "created_at": 1633098510,
                        "paid_at": 1633098510,
                        "updated_at": 1633098510
                    }
                }
            ],
            "next_action": null,
            "payment_method_options": {
                "card": {
                    "request_three_d_secure": "any"
                }
            },
            "metadata": {
                "foo": "bar"
            }
        }
    }
}
